/** 开放域外观协议v1：已发布ID只追加，禁止重排。 */
export const RANKING_CATALOG: { skins: string[]; weapons: string[]; weaponSkins: Record<string, string[]>; weaponSlots: Record<string, string> } = {
  "skins": [
    "威蓝",
    "烬猎",
    "弑岚",
    "泠汐",
    "夜喵",
    "绯朔",
    "灼戈",
    "星栗",
    "黯祁",
    "沧戈",
    "狩荒",
    "煌罡",
    "霁锋",
    "赤骁",
    "鸦暝",
    "浅燎",
    "鸢铠",
    "凌魇"
  ],
  "weapons": [
    "CN8-突击步枪",
    "DX9-冲锋枪",
    "K50-轻机枪",
    "RK77-轻机枪",
    "HK416-突击步枪",
    "SCAR-H-战斗步枪",
    "MCX-突击步枪",
    "AK12-突击步枪",
    "M249-轻机枪",
    "MG5-轻机枪",
    "霜月狼",
    "裂海鲨",
    "焚天龙",
    "ssv-狙击枪",
    "W76-狙击枪",
    "AWM-狙击枪",
    "M82A1-狙击枪",
    "FS-霰弹枪",
    "KK41-霰弹枪",
    "AA12-霰弹枪",
    "DP12-霰弹枪",
    "战术匕首",
    "刺厌",
    "科技斧",
    "熔岩剑",
    "赤牙",
    "魔刀"
  ],
  "weaponSlots": {
    "CN8-突击步枪": "步枪",
    "DX9-冲锋枪": "步枪",
    "K50-轻机枪": "步枪",
    "RK77-轻机枪": "步枪",
    "HK416-突击步枪": "步枪",
    "SCAR-H-战斗步枪": "步枪",
    "MCX-突击步枪": "步枪",
    "AK12-突击步枪": "步枪",
    "M249-轻机枪": "步枪",
    "MG5-轻机枪": "步枪",
    "霜月狼": "步枪",
    "裂海鲨": "步枪",
    "焚天龙": "步枪",
    "ssv-狙击枪": "狙击枪",
    "W76-狙击枪": "狙击枪",
    "AWM-狙击枪": "狙击枪",
    "M82A1-狙击枪": "狙击枪",
    "FS-霰弹枪": "散弹枪",
    "KK41-霰弹枪": "散弹枪",
    "AA12-霰弹枪": "散弹枪",
    "DP12-霰弹枪": "散弹枪",
    "战术匕首": "dao",
    "刺厌": "dao",
    "科技斧": "dao",
    "熔岩剑": "dao",
    "赤牙": "dao",
    "魔刀": "dao"
  },
  "weaponSkins": {
    "CN8-突击步枪": [
      "CN8-突击步枪",
      "CN8-毒剂",
      "CN8-红魔"
    ],
    "DX9-冲锋枪": [
      "DX9-冲锋枪",
      "DX9-零",
      "DX9-未来金属"
    ],
    "K50-轻机枪": [
      "K50-轻机枪",
      "K50-云雾"
    ],
    "RK77-轻机枪": [
      "RK77-轻机枪",
      "RK77-鼓手"
    ],
    "FS-霰弹枪": [
      "FS-霰弹枪",
      "FS-白弧",
      "FS-橙灼"
    ],
    "KK41-霰弹枪": [
      "KK41-霰弹枪",
      "KK41-见雪",
      "KK41-绫虹"
    ],
    "ssv-狙击枪": [
      "ssv-狙击枪",
      "ssv-星零",
      "ssv-鎏光"
    ],
    "W76-狙击枪": [
      "W76-狙击枪",
      "W76-寒汐",
      "W76-紫墟"
    ],
    "霜月狼": [
      "霜月狼"
    ],
    "裂海鲨": [
      "裂海鲨"
    ],
    "焚天龙": [
      "焚天龙"
    ]
  }
};
